import React from "react";

const AhkamHome = () => {
  return (
    <>
      <section>
        <h3>شرایط نماز و نمازگزار:</h3>
        <ul>
          <li>
            نمازگزار پیش از نماز می‌بایست، بسته به شرایط و موقعیت، وضو، غسل یا
            تیمم کرده باشد.
          </li>
          <li>
            نمازگزار، باید در هنگام خواندن نماز رو به قبله، که همان کعبه است،
            بایستد.
          </li>
          <li>
            بدن نمازگزار باید پاک باشد. لباس نمازگزار نیز باید پاک و پوشانندهٔ
            عورت باشد. همچنین لباس نمازگزار نباید غصبی، از اجزای مردار، از حیوان
            حرام گوشت و ابریشم خاص یا طلا بافت (در مردان) باشد.
          </li>
          <li>
            محلی که نمازگزار در آن نماز می‌خواند، نباید غصبی باشد. همچنین مکان
            نمازگزار باید استقرار داشته باشد و امکان نماز گزاردن در آن جا وجود
            داشته باشد.
          </li>
        </ul>
      </section>

      <style jsx>{`
        section {
          direction: rtl;
          padding: 40px 5vw;
        }

        h3 {
          font-size: 1.6rem;
        }

        ul {
          padding: 10px 40px;
        }

        li {
          font-size: 1.6rem;
          padding: 5px 0;
        }
      `}</style>
    </>
  );
};

export default AhkamHome;
