import React from "react";

const Hero = () => {
  return (
    <>
      <main className="hero-main">
        <h3>در ﺻﺤﻴﺤﻴﻦ از رﺳﻮل اﻛﺮم(ص) ﺛﺎﺑﺖ اﺳﺖ ﻛﻪ ﻓﺮﻣﻮدﻧﺪ:</h3>
        <div className="quote">
          <p className="arabic">
            «بُنِيَ الإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا
            اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ،
            وَإِيتَاءِ الزَّكَاةِ، وَصَوْمِ رَمَضَانَ، ‬و حِجُّ الْبَیتِ مَنِ
            اسْتَطاعَ إِلَیهِ سَبِیلً». [متفق علیه]
          </p>
          <p>اسلام بر پایه پنج رکن ساخته شده است:</p>
          <ol>
            <li>
              ‬ﮔﻮاهی دادن ﻛـﻪ ﺧـﺪایی ﺑﺤـﻖ ﻧﻴﺴـﺖ‪ ،‬ﻣﮕـﺮ ﺧـﺪای ﻳﻜﺘـﺎ‪ ،‬و‬
              ‫ﻣﺤﻤﺪ(ص) رﺳﻮل و ﻓﺮﺳﺘﺎده ﺧﺪاﺳﺖ‪‬‬
            </li>
            <li>ادای نماز</li>
            <li>دادن زکات</li>
            <li>روزه ماه مبارک رمضان</li>
            <li>
              حج و زیارت خانه‌ی خداوند برای کسی که استطاعت آن را داشته باشد
            </li>
          </ol>
        </div>
        <br />
        <h3>اﻳﻦ ﺣﺪﻳﺚ ﺷﺮﻳﻒ ﺷﺎﻣﻞ ارﻛﺎن ﭘﻨﺠﮕﺎﻧﻪ اﺳﻼم اﺳﺖ ﻛﻪ ﻋﺒﺎرﺗﻨﺪ از:</h3>
        <p>
          رﻛﻦ اول: ﮔﻮاﻫﻲ دادن ﻛـﻪ ﺧـﺪاﻳﻲ ﺑﺤـﻖ ﻧﻴﺴـﺖ، ﻣﮕـﺮ ﺧـﺪاي ﻳﻜﺘـﺎ، و ﻣﺤﻤﺪ(ص)
          رﺳﻮل و ﻓﺮﺳﺘﺎده ﺧﺪاﺳﺖ.
        </p>
        <p>
          ﻣﻌﻨﻲ ﺷﻬﺎدت
          <span className="arabic"> «ﻻ إﻟﻪ إﻻﱠ اﷲ» </span>
          ﻳﻌﻨﻲ: ﻣﻌﺒﻮد و ﺧﺎﻟﻖ ﺑﺤﻘﻲ ﻧﻴﺴﺖ، ﻣﮕـﺮ ﺧـﺪاي ﻳﻜﺘﺎ و ﻳﮕﺎﻧﻪ. ﭘﺲ
          <span className="arabic"> «ﻻ إﻟﻪ» </span>
          ﺗﻤﺎﻣﻲ آﻧﭽﻪ ﻏﻴﺮ از ﺧﺪا ﻋﺒﺎدت ﻣﻰﺷﻮد ﻧﻔﻲ ﻣـﻰﻛﻨـﺪ و
          <span className="arabic"> «إﻻﱠ اﷲ» </span>
          ﻋﺒﺎدت ﺧﺪاي ﻳﻜﺘﺎﻳﻲ را ﺛﺎﺑﺖ ﻣﻰﻛﻨﺪ ﻛﻪ ﻫﻴﭻ ﺷﺮﻳﻜﻲ ﻧﺪارد.
          <br />
          ﻣﻌﻨﺎي ﺷﻬﺎدت «ﻣﺤﻤﺪ رﺳﻮل اﷲ» اﻳﻤﺎن و ﺗﺼﺪﻳﻖ ﺑﻪ رﺳﺎﻟﺖ ﻣﺤﻤﺪ(ص) اﺳﺖ، و ﭼﻴﺰى
          ﻛﻪ ﻣﺤﻤﺪ(ص) آن را از ﻧﺰد ﺧـﺪاوﻧﺪ آورده ﻛﻪ اﻳﻦ اﻳﻤﺎن و ﺗﺼﺪﻳﻖ، ﺑﺎﻳﺪ ﺑﺎ
          اﻧﺠﺎم دادن و اﻃﺎﻋﺖ ﻛﺮدن از اواﻣﺮ او، و دوری ﺟﺴﺘﻦ از آﻧﭽﻪ ﻛﻪ از آن ﻧﻬﻲ
          ﻓﺮﻣﻮده ﻫﻤﺮاه ﺑﺎﺷﺪ، و اﻳﻨﻜﻪ ﺗﻤﺎﻣﻲ ﻋﺒﺎدتﻫﺎی اﻧﺴﺎن، ﻣﻄﺎﺑﻖ و ﻣﻮاﻓﻖ ﻓﺮﻣﺎﻳﺶ
          رﺳﻮل ﺧـﺪا می‌ﺑﺎﺷﺪ، ﭼﻨﺎﻧﻜﻪ ﺧﺪاوﻧﺪ ﻣﻰﻓﺮﻣﺎﻳﺪ:
        </p>
        <div className="quran">
          <p className="arabic">
            «لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا
            عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَءُوفٌ رَحِيمٌ» [سوره
            توبه - آیه ۱۲۸]
          </p>
          <p>
            قطعا براى شما پيامبرى از خودتان آمد كه بر او دشوار است‏ شما در رنج
            بيفتيد و بر [هدايت] شما سخت اصرار دارد و نسبت به مؤمنان دلسوز مهربان
            است.
          </p>
        </div>
      </main>
      <style jsx>{`
        .hero-main {
          direction: rtl;
          padding: 100px 5vw;
          /* background-image: url("/images/home/hero-bg-man.jpeg"); */
          /* background-repeat: no-repeat;
          background-size: contain;
          background-position: top;
          background-color: #09090b; */
          text-align: right;
        }

        h1 {
          padding: 20px;
          display: inline-block;
          color: black;
          padding-bottom: 6px;
        }

        li {
          list-style: arabic-indic;
        }

        .arabic {
          font-family: "Amiri", serif;
        }

        .quote {
          background-color: rgba(144, 238, 144, 0.2);
          border-right: 4px solid #276738;
          padding: 10px;
        }

        .quran {
          background-color: #dcf4ff;
          border-right: 4px solid #1e7f9d;
          padding: 10px;
        }
      `}</style>
    </>
  );
};

export default Hero;
