import React from "react";

const Hero = () => {
  return (
    <>
      <main className="hero-main">
        <div className="h1">
          <h1>آموزش اصول و احکام دین ویژه اهل سنت فقه حنفی</h1>
        </div>
        <h3>در ﺻﺤﻴﺤﻴﻦ از رﺳﻮل اﻛﺮم(ص) ﺛﺎﺑﺖ اﺳﺖ ﻛﻪ ﻓﺮﻣﻮدﻧﺪ:</h3>
        <div className="quote">
          <p className="arabic">
            «بُنِيَ الإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا
            اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ،
            وَإِيتَاءِ الزَّكَاةِ، وَصَوْمِ رَمَضَانَ، ‬و حِجُّ الْبَیتِ مَنِ
            اسْتَطاعَ إِلَیهِ سَبِیلً». [متفق علیه]
          </p>
          <p>اسلام بر پایه پنج رکن ساخته شده است:</p>
          <ol>
            <li>
              ‬ﮔﻮاهی دادن ﻛـﻪ ﺧـﺪایی ﺑﺤـﻖ ﻧﻴﺴـﺖ‪ ،‬ﻣﮕـﺮ ﺧـﺪای ﻳﻜﺘـﺎ‪ ،‬و‬
              ‫ﻣﺤﻤﺪ(ص) رﺳﻮل و ﻓﺮﺳﺘﺎده ﺧﺪاﺳﺖ‪‬‬
            </li>
            <li>ادای نماز</li>
            <li>دادن زکات</li>
            <li>روزه ماه مبارک رمضان</li>
            <li>
              حج و زیارت خانه‌ی خداوند برای کسی که استطاعت آن را داشته باشد
            </li>
          </ol>
        </div>
        <br />
        <p>اﻳﻦ ﺣﺪﻳﺚ ﺷﺮﻳﻒ ﺷﺎﻣﻞ ارﻛﺎن ﭘﻨﺠﮕﺎﻧﻪ اﺳﻼم اﺳﺖ ﻛﻪ ﻋﺒﺎرﺗﻨﺪ از:</p>
        <h3>
          رﻛﻦ اول: ﮔﻮاﻫﻲ دادن ﻛـﻪ ﺧـﺪاﻳﻲ ﺑﺤـﻖ ﻧﻴﺴـﺖ، ﻣﮕـﺮ ﺧـﺪاي ﻳﻜﺘـﺎ، و ﻣﺤﻤﺪ(ص)
          رﺳﻮل و ﻓﺮﺳﺘﺎده ﺧﺪاﺳﺖ.
        </h3>
        <p>
          ﻣﻌﻨﻲ ﺷﻬﺎدت
          <span className="arabic-in"> «ﻻ إﻟﻪ إﻻﱠ اﷲ» </span>
          ﻳﻌﻨﻲ: ﻣﻌﺒﻮد و ﺧﺎﻟﻖ ﺑﺤﻘﻲ ﻧﻴﺴﺖ، ﻣﮕـﺮ ﺧـﺪاي ﻳﻜﺘﺎ و ﻳﮕﺎﻧﻪ. ﭘﺲ
          <span className="arabic-in"> «ﻻ إﻟﻪ» </span>
          ﺗﻤﺎﻣﻲ آﻧﭽﻪ ﻏﻴﺮ از ﺧﺪا ﻋﺒﺎدت ﻣﻰﺷﻮد ﻧﻔﻲ ﻣـﻰﻛﻨـﺪ و
          <span className="arabic-in"> «إﻻﱠ اﷲ» </span>
          ﻋﺒﺎدت ﺧﺪاي ﻳﻜﺘﺎﻳﻲ را ﺛﺎﺑﺖ ﻣﻰﻛﻨﺪ ﻛﻪ ﻫﻴﭻ ﺷﺮﻳﻜﻲ ﻧﺪارد.
          <br />
          ﻣﻌﻨﺎي ﺷﻬﺎدت «ﻣﺤﻤﺪ رﺳﻮل اﷲ» اﻳﻤﺎن و ﺗﺼﺪﻳﻖ ﺑﻪ رﺳﺎﻟﺖ ﻣﺤﻤﺪ(ص) اﺳﺖ، و ﭼﻴﺰى
          ﻛﻪ ﻣﺤﻤﺪ(ص) آن را از ﻧﺰد ﺧـﺪاوﻧﺪ آورده ﻛﻪ اﻳﻦ اﻳﻤﺎن و ﺗﺼﺪﻳﻖ، ﺑﺎﻳﺪ ﺑﺎ
          اﻧﺠﺎم دادن و اﻃﺎﻋﺖ ﻛﺮدن از اواﻣﺮ او، و دوری ﺟﺴﺘﻦ از آﻧﭽﻪ ﻛﻪ از آن ﻧﻬﻲ
          ﻓﺮﻣﻮده ﻫﻤﺮاه ﺑﺎﺷﺪ، و اﻳﻨﻜﻪ ﺗﻤﺎﻣﻲ ﻋﺒﺎدتﻫﺎی اﻧﺴﺎن، ﻣﻄﺎﺑﻖ و ﻣﻮاﻓﻖ ﻓﺮﻣﺎﻳﺶ
          رﺳﻮل ﺧـﺪا می‌ﺑﺎﺷﺪ، ﭼﻨﺎﻧﻜﻪ ﺧﺪاوﻧﺪ ﻣﻰﻓﺮﻣﺎﻳﺪ:
        </p>
        <div className="quran">
          <p className="arabic">
            ‫﴿‬لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا
            عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَءُوفٌ رَحِيمٌ‫﴾
            <span className="source">[سوره توبه - آیه ۱۲۸]</span>‬
          </p>
          <p>
            «قطعا براى شما پيامبرى از خودتان آمد كه بر او دشوار است‏ شما در رنج
            بيفتيد و بر [هدايت] شما سخت اصرار دارد و نسبت به مؤمنان دلسوز مهربان
            است.»
          </p>
        </div>
        <br />
        <div className="quran">
          <p className="arabic">
            ‫﴿‬مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ ۖ‫﴾
            <span className="source">[سوره النساء - آیه ۸۰]‬</span>
          </p>
          <p>
            «ﻫﺮﻛﺲ از رﺳﻮل(ﺧﺪا) اﻃﺎﻋﺖ ﻛﻨﺪ، در ﺣﻘﻴﻘﺖ از ﺧﺪاوﻧﺪ ﻓﺮﻣﺎن ﺑﺮده اﺳﺖ.»
          </p>
        </div>
        <br />
        <div className="quran">
          <p className="arabic">
            ‫﴿وَأَطِيعُوا اللَّهَ وَالرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ ۖ‫﴾
            <span className="source">[سوره آل عمران - آیه ۱۳۲]‬</span>
          </p>
          <p>
            «و از ﺧﺪاوﻧﺪ و رﺳﻮل(او) ﻓﺮﻣﺎن ﺑﺮﻳﺪ، ﺑﺎﺷﺪ ﻛﻪ ﻣﺸﻤﻮل رﺣﻤﺖ ﻗﺮار ﮔﻴﺮﻳﺪ.»
          </p>
        </div>
        <br />
        <h3>
          رﻛﻦ دوم و ﺳﻮم: اداي ﻧﻤﺎز، و دادن زﻛﺎت اﺳﺖ ﭼﻨﺎﻧﻜﻪ ﺧﺪاوﻧﺪ ﻣﺘﻌﺎل
          می‌فرماید:
        </h3>
        <div className="quran">
          <p className="arabic">
            ‫﴿وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ
            الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ
            وَذَلِكَ دِينُ الْقَيِّمَةِ‫﴾
            <span className="source">[سوره البينة - آیه ۵]‬</span>
          </p>
          <p>
            «و فرمان نيافته بودند جز اينكه خدا را بپرستند و در حالى كه به توحيد
            گراييده‏ اند دين [خود] را براى او خالص گردانند و نماز برپا دارند و
            زكات بدهند و دين [ثابت و] پايدار همين است.»
          </p>
        </div>
        <br />
        <div className="quran">
          <p className="arabic">
            ‫﴿وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَارْكَعُوا مَعَ
            الرَّاكِعِينَ‫﴾
            <span className="source">[سوره البقرة - آیه ۴۳]‬</span>
          </p>
          <p>
            «و نماز را بر پا داريد و زكات بپردازید و با ركوع ‏كنندگان ركوع
            كنيد.»
          </p>
        </div>
        <br />
        <h3>رﻛﻦ ﭼﻬﺎرم: روزه ﻣﺎه ﻣﺒﺎرك رﻣﻀﺎن اﺳﺖ؛ ﭼﻨﺎﻧﻜﻪ ﻣﻰﻓﺮﻣﺎﻳﺪ:</h3>
        <div className="quran">
          <p className="arabic">
            ‫﴿يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا
            كُتِبَ عَلَى الَّذِينَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ‫﴾
            <span className="source">[سوره البقرة - آیه ۱۸۳]‬</span>
          </p>
          <p>
            «اى كسانى كه ايمان آورده‏ ايد روزه بر شما مقرر شده است، همان گونه كه
            بر كسانى كه پيش از شما [بودند] مقرر شده بود، باشد كه پرهيزگارى
            كنيد.»
          </p>
        </div>
        <br />
        <h3>
          رﻛﻦ ﭘﻨﺠﻢ: ﺣﺞ و زﻳﺎرت ﺧﺎنه ﺧﺪاوﻧﺪ اﺳﺖ ﺑﺮاي ﻛﺴﻲ ﻛﻪ اﺳـﺘﻄﺎﻋﺖ آن را داﺷﺘﻪ
          ﺑﺎﺷﺪ، چنانکه خداوند می‌فرماید:
        </h3>
        <div className="quran">
          <p className="arabic">
            ‫﴿وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ
            سَبِيلًا وَمَنْ كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ‫﴾
            <span className="source">[سوره آل عمران - آیه ۹۷]‬</span>
          </p>
          <p>
            « و براى خداوند حج خانه(کعبه) بر (عهده) مردم است [البته برای] كسى كه
            بتواند به سوى آن راه يابد و هر كه كفر ورزد (بداند که) یقینا خداوند
            از جهانيان بى ‏نياز است.»
          </p>
        </div>
      </main>
      <style jsx>{`
        .hero-main {
          direction: rtl;
          padding: 100px 5vw;
          text-align: right;
          text-align: justify;
        }

        .h1 {
          text-align: center;
        }

        h1 {
          padding: 20px;
          display: inline-block;
        }

        p {
          line-height: 1.9;
        }

        li {
          list-style: arabic-indic;
        }

        .arabic {
          font-family: "Amiri", serif;
          font-size: larger;
          line-height: 2.2;
        }

        .arabic-in {
          font-family: "Amiri", serif;
        }

        .quran {
          background-color: rgba(144, 238, 144, 0.2);
          border-right: 4px solid #276738;
          padding: 10px;
        }

        .quote {
          background-color: #dcf4ff;
          border-right: 4px solid #1e7f9d;
          padding: 10px;
        }

        .source {
          font-size: small;
          color: blue;
        }
      `}</style>
    </>
  );
};

export default Hero;
