import React from "react";
import Prays from "../../../pages/prays";

const Vozu = () => {
  return (
    <>
      <main>
        <p>خداوند می‌فرماید:</p>
        <div className="quran">
          <p className="arabic">
            ‫﴿يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ
            فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ
            وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ وَإِنْ
            كُنْتُمْ جُنُبًا فَاطَّهَّرُوا وَإِنْ كُنْتُمْ مَرْضَى أَوْ عَلَى
            سَفَرٍ أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ أَوْ لَامَسْتُمُ
            النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا
            فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ مِنْهُ مَا يُرِيدُ اللَّهُ
            لِيَجْعَلَ عَلَيْكُمْ مِنْ حَرَجٍ وَلَكِنْ يُرِيدُ لِيُطَهِّرَكُمْ
            وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ﴾
            <span className="source">[سوره المائدة - آیه ۶]‬</span>
          </p>
          <p>
            «اى كسانى كه ايمان آورده‏ ايد چون به [قصد] نماز برخيزيد صورت و
            دستهايتان را تا آرنج بشوييد و سرتان را مسح كنيد و پاهایتان را تا دو
            کعب(قوزک) بشویید. و اگر جنب‏ايد خود را پاك كنيد [=غسل نماييد] و اگر
            بيمار يا در سفر بوديد يا يكى از شما از قضاى حاجت آمد يا با زنان
            نزديكى كرده‏ ايد و آبى نيافتيد پس با خاك پاك تيمم كنيد و از آن به
            صورت و دستهايتان بكشيد خدا نمى‏ خواهد بر شما تنگ بگيرد ليكن مى‏
            خواهد شما را پاك و نعمتش را بر شما تمام گرداند باشد كه سپاس [او]
            بداريد.»
          </p>
        </div>
        <br />
        <h3>آموزش وضو:</h3>
        <ol>
          <li>گفتن ذکر "بسم الله"</li>
          <li>سه بار شستن دست‌ها تا مچ </li>
          <li>سه بار مضمضه کردن(شستشوی دهان با آب)</li>
          <li>سه بار استنشاق یا شستن بینی</li>
          <li>سه بار شستن صورت</li>
          <li> سه بار شستن دست‌ها از نوک انگشتان تا آرنج</li>
          <li>
            مسح تمام سر، با دو دست از جلو به سمت عقب سر و برگرداندن دست از همان
            مسیر
          </li>
          <li>مسح گوش‌ها</li>
          <li>سه بار شستن پاها تا مچ </li>
        </ol>
      </main>

      <style jsx>{`
        main {
          direction: rtl;
          padding: 100px 5vw;
          text-align: right;
          text-align: justify;
        }

        p {
          line-height: 1.9;
        }

        li {
          list-style: arabic-indic;
        }

        .arabic {
          font-family: "Amiri", serif;
          font-size: larger;
          line-height: 2.2;
        }

        .quran {
          position: relative;
          background-color: rgba(144, 238, 144, 0.2);
          border-right: 4px solid #276738;
          padding: 10px;
        }

        .source {
          position: absolute;
          bottom: 0;
          left: 5px;
          font-size: small;
          color: blue;
        }
      `}</style>
    </>
  );
};

export default Vozu;
