import React from "react";

const Vozu = () => {
  return (
    <>
      <main>
        <p>
          يكی از شرایطی كه نمازگزار بايد داشته باشد وضو است. وضو باعث پاکی بدن و
          صفای روح و روشنی دل ميگردد، چنانکه خداوند می‌فرماید:
        </p>
        <div className="quran">
          <p className="arabic">
            ‫﴿يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ
            فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ
            وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ وَإِنْ
            كُنْتُمْ جُنُبًا فَاطَّهَّرُوا وَإِنْ كُنْتُمْ مَرْضَى أَوْ عَلَى
            سَفَرٍ أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ أَوْ لَامَسْتُمُ
            النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا
            فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ مِنْهُ مَا يُرِيدُ اللَّهُ
            لِيَجْعَلَ عَلَيْكُمْ مِنْ حَرَجٍ وَلَكِنْ يُرِيدُ لِيُطَهِّرَكُمْ
            وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ﴾
            <span className="source">[سوره المائدة - آیه ۶]‬</span>
          </p>
          <p>
            «اى كسانى كه ايمان آورده‏ ايد چون به [قصد] نماز برخيزيد صورت و
            دستهايتان را تا آرنج بشوييد و سرتان را مسح كنيد و پاهایتان را تا دو
            کعب(قوزک) بشویید. و اگر جنب‏ايد خود را پاك كنيد [=غسل نماييد] و اگر
            بيمار يا در سفر بوديد يا يكى از شما از قضاى حاجت آمد يا با زنان
            نزديكى كرده‏ ايد و آبى نيافتيد پس با خاك پاك تيمم كنيد و از آن به
            صورت و دستهايتان بكشيد خدا نمى‏ خواهد بر شما تنگ بگيرد ليكن مى‏
            خواهد شما را پاك و نعمتش را بر شما تمام گرداند باشد كه سپاس [او]
            بداريد.»
          </p>
        </div>
        <br />
        <h3>مراحل انجام وضو به ترتیب زیر است:</h3>
        <ol>
          <li>
            <b>گفتن اعوذ بالله و بسم الله</b>، قبل از هر چيز می‌گوییم:
            <div className="quran">
              <p className="arabic">
                اَعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ
                <br />
                بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ
              </p>
              <p>
                از شرّ شيطان رانده شده به خداوند پناه ميبرم و با نام خداوند
                بخشنده ی مهربان شروع ميكنم.
              </p>
            </div>
            <br />
          </li>
          <li>
            <b>نیت</b>، سپس اینگونه نیت می‌کنیم:
            <div className="quote">
              <p>نيت كردم وضو گرفتن را جهت تقرّب به درگاه الهی</p>
            </div>
          </li>
          <br />
          <li>
            <b>شستن دست‌ها تا مچ</b>، دستها را تا مچ سه بار ميشوييم و دقت ميكنيم
            كه لای انگشتان نيز كاملاً شسته شوند.
          </li>
          <br />
          <li>
            <b>مضمضه يا شستن دهان</b>، بـا دسـت راست سه بـار بـه دهـان آب
            ميگيـريـم و با غرغره كردن كاملاً آن را ميشوييم.
          </li>
          <div className="danger">
            <p>
              اما در ماه مبارك رمضان به خاطر احتمال رفتن آب به گلو لازم نيست
              غرغره كرده شود.
            </p>
          </div>
          <p className="close-top">
            بهتر است هنگام شستن دهان، دندان‌ها را مسواك زد.
          </p>
          <li>
            <b>استنشاق یا شستن بینی</b>، با دست راست، سه بار آب به بينی گرفته و
            با دست چپ كاملاً آن را تميز می‌كنيم.
          </li>
          <br />
          <li>
            <b>شستن صورت</b>، صورت را از بالای پيشانی - از محلی كه موی سر روئيده
            است و از دو طرف تا گوش و از پايين تا زير چانه سه بار كامل و دقيق
            می‌شوييم.
          </li>
          <br />
          <li>
            <b>شستن دست راست</b>، دست راست را از نوك انگشتان تا آرنج سه بار
            می‌شوييم. بايد توجه داشت كه خود آرنج نيز شسته شود.
          </li>
          <br />
          <li>
            <b>شستن دست چپ</b>، دست چپ را نيز همانند دست راست سه بار می‌شوييم.
          </li>
          <br />
          <li>
            <b>مسح سر و گوش</b>، به دست‌ها آب تازه‌ای گرفته و تَر می‌كنيم. سپس
            تمامی سر را با دست‌های خيس لمس می‌كنيم طوری كه هيچ جایی از موهای سر
            خشك باقی نماند. سپس دو انگشت اشاره را به گوش‌ها فرو برده و با
            انگشتان شصت، پشت گوش‌ها را مسح می‌كنيم.
          </li>
          <br />
          <li>
            <b>مسح گردن</b>، سپس با پشت انگشتان دست در حالی كه انگشتان دست‌ها را
            به هم چسبانيده‌ايم با دست راست طرف راست گردن و با دست چپ طرف چپ گردن
            را مسح می‌كنيم.
          </li>
          <br />
          <li>
            <b> شستن پای راست</b>، پای راست را از نوك انگشتان تا قوزك پا سه بار
            ميشوييم. بايد توجه داشت كه قوزك پا و لای انگشتان نيز كاملاً شسته
            شوند.
          </li>
          <br />
          <li>
            <b>شستن پای چپ</b>، پای چپ را نيز همانند پای راست سه بار تا قوزك پا
            می‌شوييم.
          </li>
        </ol>
      </main>

      <style jsx>{`
        p {
          line-height: 1.9;
        }

        li {
          list-style: arabic-indic;
        }

        .arabic {
          font-family: "Amiri", serif;
          font-size: larger;
          line-height: 2.2;
        }

        .quran {
          position: relative;
          background-color: rgba(144, 238, 144, 0.2);
          border-right: 4px solid #276738;
          padding: 5px 10px;
        }

        .source {
          position: absolute;
          bottom: 0;
          left: 5px;
          font-size: small;
          color: blue;
        }

        .quote {
          background-color: #dcf4ff;
          border-right: 4px solid #1e7f9d;
          padding: 5px 10px;
        }

        .danger {
          background-color: #ffd5b2;
          border-right: 4px solid red;
          padding: 5px 10px;
        }

        .close-top {
          padding-top: 0;
          margin-top: 0;
        }
      `}</style>
    </>
  );
};

export default Vozu;
