import React from "react";
import { Link } from "next/link";

const Fast = () => {
  return (
    <>
      <section className="main">
        <p>
          روزه در اسلام عملی است که انسان از اذان صبح تا اذان مغرب از چیزهایی که
          روزه را باطل می‌کند خودداری نماید.
          <br />
          روزه ماه رمضان از ستون‌های دین اسلام شمرده می‌شود و بر همه مسلمانان
          بالغ، عاقل و سالم
          <b> واجب </b>
          است در این ماه روزه بگیرند. در قرآن کریم آمده است که:
        </p>
        <div className="quran">
          <p className="arabic">
            ‫﴿يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا
            كُتِبَ عَلَى الَّذِينَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ‫﴾
            <span className="source">[سوره البقرة - آیه ۱۸۳]‬</span>
          </p>
          <p>
            «اى كسانى كه ايمان آورده‏ ايد روزه بر شما مقرر شده است، همان گونه كه
            بر كسانى كه پيش از شما [بودند] مقرر شده بود، باشد كه پرهيزگارى
            كنيد.»
          </p>
        </div>
        <br />
        <div className="quran">
          <p className="arabic">
            ‫﴿أَيَّامًا مَعْدُودَاتٍ فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ عَلَى
            سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ وَعَلَى الَّذِينَ يُطِيقُونَهُ
            فِدْيَةٌ طَعَامُ مِسْكِينٍ فَمَنْ تَطَوَّعَ خَيْرًا فَهُوَ خَيْرٌ
            لَهُ وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ‫﴾
            <span className="source">[سوره البقرة - آیه ۱۸۴]‬</span>
          </p>
          <p>
            «[روزه در] روزهاى معدودى [بر شما مقرر شده است] [ولى] هر كس از شما
            بيمار يا در سفر باشد [به همان شماره] تعدادى از روزهاى ديگر [را روزه
            بدارد] و بر كسانى كه [روزه] طاقت‏ فرساست كفاره‏ اى است كه خوراك دادن
            به بينوايى است و هر كس به ميل خود بيشتر نيكى كند پس آن براى او بهتر
            است و اگر بدانيد روزه گرفتن براى شما بهتر است.»
          </p>
        </div>
        <br />
        <div className="quran">
          <p className="arabic">
            ‫﴿شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ
            وَبَيِّنَاتٍ مِنَ الْهُدَى وَالْفُرْقَانِ فَمَنْ شَهِدَ مِنْكُمُ
            الشَّهْرَ فَلْيَصُمْهُ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ
            فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ
            وَلَا يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ
            وَلِتُكَبِّرُوا اللَّهَ عَلَى مَا هَدَاكُمْ وَلَعَلَّكُمْ
            تَشْكُرُونَ‫﴾
            <span className="source">[سوره البقرة - آیه ۱۸۵]‬</span>
          </p>
          <p>
            «ماه رمضان [همان ماه] است كه در آن قرآن فرو فرستاده شده است [كتابى ]
            كه مردم را راهبر و [متضمن] دلايل آشكار هدايت و [ميزان] تشخيص حق از
            باطل است پس هر كس از شما اين ماه را درك كند بايد آن را روزه بدارد و
            كسى كه بيمار يا در سفر است [بايد به شماره آن] تعدادى از روزهاى ديگر
            [را روزه بدارد] خدا براى شما آسانى مى‏ خواهد و براى شما دشوارى نمى‏
            خواهد تا شماره [مقرر] را تكميل كنيد و خدا را به پاس آنكه رهنمونيتان
            كرده است به بزرگى بستاييد و باشد كه شكرگزارى كنيد.»
          </p>
        </div>
        <br />
        <div className="quran">
          <p className="arabic">
            ‫﴿أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ
            هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُنَّ عَلِمَ اللَّهُ
            أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ
            وَعَفَا عَنْكُمْ فَالْآنَ بَاشِرُوهُنَّ وَابْتَغُوا مَا كَتَبَ
            اللَّهُ لَكُمْ وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ
            الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ
            ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ وَلَا تُبَاشِرُوهُنَّ
            وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ تِلْكَ حُدُودُ اللَّهِ فَلَا
            تَقْرَبُوهَا كَذَلِكَ يُبَيِّنُ اللَّهُ آيَاتِهِ لِلنَّاسِ
            لَعَلَّهُمْ يَتَّقُونَ‫﴾
            <span className="source">[سوره البقرة - آیه ۱۸۷]‬</span>
          </p>
          <p>
            «در شبهاى روزه همخوابگى با زنانتان بر شما حلال گرديده است آنان براى
            شما لباسى هستند و شما براى آنان لباسى هستيد خدا مى‏ دانست كه شما با
            خودتان ناراستى میکرديد پس توبه شما را پذيرفت و از شما درگذشت پس
            اكنون [در شبهاى ماه رمضان مى‏ توانيد] با آنان همخوابگى كنيد و آنچه
            را خدا براى شما مقرر داشته طلب كنيد و بخوريد و بياشاميد تا رشته سپيد
            بامداد از رشته سياه [شب] بر شما نمودار شود سپس روزه را تا [فرا
            رسيدن] شب به اتمام رسانيد و در حالى كه در مساجد معتكف هستيد [با
            زنان] درنياميزيد اين است‏ حدود احكام الهى پس [زنهار به قصد گناه]
            بدان نزديك نشويد اين گونه خداوند آيات خود را براى مردم بيان مى ‏كند
            باشد كه پروا پيشه كنند.»
          </p>
        </div>
        <br />
        <h3>در اسلام در چند مورد روزه گرفتن حرام است: </h3>
        <ul>
          <li>روزه در روز عید فطر و عید قربان</li>
          <li>
            در روزی که انسان نمی‌داند آخر ماه شعبان است یا اول ماه رمضان، اگر به
            نیت اول ماه رمضان روزه بگیرد، این روزه حرام است.
          </li>
          <li>
            اگر کسی یقین یا گمان دارد روزه برایش مضر است، روزه بگیرد، روزه‌اش
            صحیح نیست.
          </li>
        </ul>
        <br />
        <h3>چه کسانی مستثنا هستند؟</h3>
        <ul>
          <li>
            افراد مسن یا بیمارانی که امید به بهبودی برایشان نیست، در صورت عدم
            توانائی می‌توانند از روزه گرفتن خودداری کنند بدون آنکه مجبور به به
            جای آوردن قضای آن باشند. این افراد باید به ازای هر روزی که روزه
            نگرفتند یک مٔد طعام ببخشند.
          </li>
          <li>
            اگر زنان باردار یا شیرده بترسند که روزه برایشان خطرناک باشد، شکستن
            روزه بر آن‌ها واجب است؛ گرچه قضای روزه نیز بر گردن آن‌هاست.
          </li>
          <li>
            بیمارانی که احتمال بهبودی برایشان می‌رود و آن‌هایی که تاب گرسنگی و
            تشنگی را ندارند، می‌توانند روزه‌شان را بشکنند به شرط آنکه قضایش را
            به جای آورند.
            <br />
            اگر انسانی در خطر مرگ یا از دست دادن عضوی از اعضای بدن است، شکستن
            روزه بر او واجب می‌گردد.
          </li>
          <li>
            مسافرانی که پیش از طلوع خورشید سفرشان را آغاز می‌کنند، اگر ضروری
            باشد، می‌توانند روزشان را بشکنند؛ گرچه اگر سفرشان را هنگام روز شروع
            کنند چنین حکمی برایشان وجود ندارد. اگر خطر جانی وجود داشته باشد،
            شکستن روزه واجب است. حداقل طول سفر باید دو روز باشد. قضا در این حالت
            نیز بر گردن آن‌هاست.
          </li>
          <li>
            آن‌هایی که کارهای بدنی سنگین باید انجام دهند، باید هنگام شب نیّت
            روزه کنند، ولی [در طول روز] اگر نیاز شد می‌توانند روزه‌شان را
            بشکنند.
          </li>
        </ul>
      </section>

      <style jsx>{`
        p,
        li {
          line-height: 1.9;
        }

        li {
          list-style: square;
          padding-bottom: 0.5rem;
        }

        .arabic {
          padding: 0;
          padding-top: 10px;
          margin: 0;
          font-family: "Amiri", serif;
          font-size: larger;
          line-height: 2.2;
        }

        .quran {
          position: relative;
          background-color: rgba(144, 238, 144, 0.2);
          border-right: 4px solid #276738;
          padding: 10px;
        }

        .source {
          position: absolute;
          bottom: 0;
          left: 5px;
          font-size: small;
          color: blue;
        }

        .quote {
          background-color: #dcf4ff;
          border-right: 4px solid #1e7f9d;
          padding: 5px 10px;
        }

        .danger {
          background-color: #ffd5b2;
          border-right: 4px solid red;
          padding: 5px 10px;
        }

        .close-top {
          padding-top: 0;
          margin-top: 0;
        }
      `}</style>
    </>
  );
};

export default Fast;
